kuangt0654030110/Bbear/nRF5_SDK_15.0.0_a53641a/examples/ble_peripheral/ble_app_template/main.c
#if NRF_MODULE_ENABLED(NTN_AND_BAT_ADC)	
		clear_wdt();
 		nrf_saadc_value_t BatAdcResult;
		nrf_saadc_value_t NTNAdcResult;
		if((count%2) == 0) {
			ADC_BlockRead(0, &BatAdcResult);
			Battery_data = (ADC_RESULT_IN_MILLI_VOLTS(BatAdcResult) * 2.0);
			AlmInitProfile_SetData(NULL, ALMINITPROFILE_CHAR3, (uint8_t*)&Battery_data, sizeof(Battery_data));
		} else {
			enable_temperature_channel(true);
			nrf_delay_us(50);
			ADC_BlockRead(1, &NTNAdcResult);
			double vdd = Battery_data;
			double vi  = ADC_RESULT_IN_MILLI_VOLTS(NTNAdcResult);
			double rt = 30900 * vi /(vdd - vi);
			
			temperature_data = Get_Kelvin_Temperature(rt);
			AlmInitProfile_SetData(NULL, ALMINITPROFILE_CHAR4, (uint8_t*)&temperature_data, sizeof(temperature_data));
			enable_temperature_channel(false);
 		}
		clear_wdt();
#endif
	  if(m_conn_handle == BLE_CONN_HANDLE_INVALID) {
				if (fast_mode_enable) {
					if (fast_mode_count > FAST_MODE_TIMEOUT) {
						fast_mode_count = 0;
						fast_mode_enable = false;
					}
					fast_mode_count++;
				} else {
					bool need_adv = false;
					
					if (fast_to_slow_mode_change) {
						fast_to_slow_mode_change = false;
						need_adv = true;
					}
					
					if ((count%2) == 1) {
						need_adv = true;
					}
					if (need_adv) {
						advertising_restart(false);
					}
				}
		} else {
			if (fast_mode_enable) {
				fast_mode_count = 0;
				fast_mode_enable = false;
				fast_to_slow_mode_change = false;
			}
			if (m_BleDataChannelEnable && m_CharConnHandle != BLE_CONN_HANDLE_INVALID) {
					uint8 data[20];
					memset(data,0,sizeof(data));
				  data[0] = 0x03;
					AlmInitProfile_PushNotifyData(m_CharConnHandle, &m_AlmInitProfile, (uint8 *)&data, 3);
			}
		}
		
		count++;
		application_timers_start(TIMER_INTERVAL);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.*/
     err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_SINGLE_SHOT, timer_timeout_handler);
     APP_ERROR_CHECK(err_code); 
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
	
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */
																					
#if OPEN_PAIRING															
		/** 设置静态密码*/
		ble_opt_t passkey_opt;
    uint8_t passkey[] = "123456";
    passkey_opt.gap_opt.passkey.p_passkey = passkey;
    err_code = sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &passkey_opt);
    APP_ERROR_CHECK(err_code);
#endif			
																					
    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the service you are using can generate
 *
 * @details This function will be called for all YY Service events which are passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. ", p_evt->params.char_xx.value.p_str);
            break;

        default:
            // No implementation needed.
            break;
    }
}
*/

/**
 @brief 自定义初始化服务处理特征值函数
 @param connHandle -[in] 连接句柄
 @param charId -[in] 特征值ID
 @param pAlmInitProfile -[in] ALM初始化服务结构体
 @param pCharValue -[in] 写入特征值
 @param length -[in] 写入特征长度
 @return 无
*/


void AlmInitProfile_HandleCharValue(uint16 connHandle, uint8 charId, AlmInitProfile_t *pAlmInitProfile,
									const uint8 *pCharValue, uint16 length)
{
	uint8 data[20] = {0};
	uint32 data_len = sizeof(data);
	
	switch(charId) {
		case ALMINITPROFILE_CHAR1:																							// 通知功能 
			break;
		
			case ALMINITPROFILE_CHAR2:	
			if (length == 1) {
					if (pCharValue[0] == BATTERY_CMD) {
							memcpy(&data[1], (void *) &Battery_data, sizeof(Battery_data));
							data_len = sizeof(Battery_data);
					} else if(pCharValue[0] == TEMPERATURE_CMD) {
							memcpy(&data[1], (void *) &temperature_data, sizeof(temperature_data));
							data_len = sizeof(temperature_data);
					} else if (pCharValue[0] == 0x03) {
							m_AlmInitProfile = *pAlmInitProfile;
							m_BleDataChannelEnable = true;
							m_CharConnHandle = connHandle;
							break;
					} else {
							break;
					}
					data[0] = pCharValue[0];
					data_len++;
					AlmInitProfile_PushNotifyData(connHandle, pAlmInitProfile, (uint8 *)data, data_len);	// 通知
			}
			
			break;
			
