kuangt0654030110/Bbear/nRF5_SDK_15.0.0_a53641a/examples/ble_peripheral/ble_app_template/main.c
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;
				
#if OPEN_PAIRING
				case BLE_GAP_EVT_SEC_REQUEST:  /** 返回配对请求*/
				{
						ble_gap_sec_params_t sec_params;
						memset(&sec_params,0,sizeof(ble_gap_sec_params_t));
						err_code = sd_ble_gap_sec_params_reply(m_conn_handle,BLE_GAP_SEC_STATUS_SUCCESS,&sec_params,NULL);
						APP_ERROR_CHECK(err_code);
						break;
				}
				
				case BLE_GAP_EVT_AUTH_STATUS:
						if(p_ble_evt->evt.gap_evt.params.auth_status.auth_status == BLE_GAP_SEC_STATUS_SUCCESS) {
								NRF_LOG_INFO("Pair success!");
						} else {
								NRF_LOG_INFO("Pair failed!");
								sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
								delete_bonds();
						}
						break;
						
				case BLE_GAP_EVT_PASSKEY_DISPLAY:
						NRF_LOG_INFO("PASSKEY:%s",p_ble_evt->evt.gap_evt.params.passkey_display.passkey);
						break;
				
				case PM_EVT_CONN_SEC_CONFIG_REQ://重新连接
				{
						//允许再次配对
						pm_conn_sec_config_t conn_sec_config = {.allow_repairing = true};
						pm_conn_sec_config_reply(m_conn_handle, &conn_sec_config);
						break;
				}
#endif
        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 */
static void bsp_event_handler(bsp_event_t event)
{
    switch (event)
    { 
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break; // BSP_EVENT_SLEEP
						
				case BSP_EVENT_BUTTON_PUSH:
						app_timer_stop(get_m_bsp_leds_tmr());
						bsp_indication_set(BSP_INDICATE_USER_STATE_ON);
						app_timer_start(get_m_bsp_leds_tmr(),APP_TIMER_TICKS(200), (void * )0);
						break;

					case BSP_EVENT_BUTTON_LONG_PUSH:
						if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
							app_timer_stop(get_m_bsp_leds_tmr());
							bsp_indication_set(BSP_INDICATE_USER_STATE_OFF);
							app_timer_start(get_m_bsp_leds_tmr(),APP_TIMER_TICKS(200), (void * )1);
							fast_mode_enable = true;
							fast_mode_count = 0;
							fast_to_slow_mode_change = false;
							advertising_restart(true);
						}
						break;
						
        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(bool fast_mode)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;
		adv_data data;
		ble_advdata_manuf_data_t manuf_data = {0};
		int8_t tx_power_level = 4;
		
		memset(&data,0,sizeof(data));
		data.temperature_data = temperature_data;
		data.Battery_data = Battery_data;
		data.fast_flag = fast_mode ? 1 : 0;
		
		manuf_data.company_identifier = COMPANY_IDENTIFIER;
		manuf_data.data.size = sizeof(data);
		manuf_data.data.p_data = (void *) &data;
		
