kuangt0654030110/Bbear/nRF5_SDK_15.0.0_a53641a/examples/ble_peripheral/ble_app_template/main.c
    memset(&init, 0, sizeof(init));
		
    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = false;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids; 
		init.advdata.p_manuf_specific_data   = &manuf_data;
		init.advdata.p_tx_power_level = &tx_power_level;
		
    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
		init.config.ble_adv_slow_enabled   = true;
		init.config.ble_adv_slow_interval  = APP_ADV_SLOW_INTERVAL;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
		
		err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_advertising.adv_handle , tx_power_level);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

     err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
     APP_ERROR_CHECK(err_code);
 
    //err_code = bsp_btn_ble_init(NULL, &startup_event);
    //APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

#if NRF_MODULE_ENABLED(NRF_LOG)
/**@brief Function for initializing the nrf log module.
*/
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}
#endif

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
		nrf_power_dcdcen_set(1);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
 	
        APP_ERROR_CHECK(err_code);
    }
}

static void advertising_restart(bool fast_mode)
{	 
		ret_code_t err_code;
		ble_adv_mode_t mode = BLE_ADV_MODE_SLOW;
		if (fast_mode) {
			mode = BLE_ADV_MODE_FAST;
		}
		sd_ble_gap_adv_stop(m_advertising.adv_handle);
		advertising_init(fast_mode);
	  err_code = ble_advertising_start(&m_advertising, mode);
    APP_ERROR_CHECK(err_code);
}

void wdt_event_handler(void)
{
    //NOTE: The max amount of time we can spend in WDT interrupt is two cycles of 32768[Hz] clock - after that, reset occurs
}

int init_wdt(void)
{
		uint32_t err_code = NRF_SUCCESS;
#if OPEN_WDT
    //Configure WDT.
    nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_wdt_channel_alloc(&m_channel_id);
    APP_ERROR_CHECK(err_code);
    nrf_drv_wdt_enable();
#endif		
	return err_code;
}

void clear_wdt(void)
{
#if OPEN_WDT
	nrf_drv_wdt_channel_feed(m_channel_id);
#endif
}

void enable_temperature_channel(bool en) 
{
	if (en) {
		nrf_gpio_pin_clear(TEMPERATURE_ENBALE_GPIO);
	} else {
		nrf_gpio_pin_set(TEMPERATURE_ENBALE_GPIO);
	}
}

void init_temperature_channel(void)
{
	nrf_gpio_cfg_output(TEMPERATURE_ENBALE_GPIO);
}

/**@brief Function for application main entry.
 */
int main(void)
{
		bool erase_bonds;
	
#if NRF_MODULE_ENABLED(NRF_LOG)
    log_init();
#endif
		init_temperature_channel();
    timers_init();
		init_wdt();
		buttons_leds_init(&erase_bonds);
    power_management_init();
		clear_wdt();
    ble_stack_init();
    gap_params_init();
    gatt_init();
		clear_wdt();
    advertising_init(true);
    services_init();
    conn_params_init();
    peer_manager_init();
		clear_wdt();
    NRF_LOG_INFO("Template example started.");
		clear_wdt();
    advertising_start(erase_bonds);
		
#if NRF_MODULE_ENABLED(NTN_AND_BAT_ADC)
		ADC_Init(); // 开启ADC
#endif
		application_timers_start(TIMER_INTERVAL);
    // Enter main loop.
    for (;;) {
        idle_state_handle();
				clear_wdt();
    }
}


/**
 * @}
 */
